In [9]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'sex' : [1, 2, 1, 3, 2, 1],
                   'score' : [5, 4, 3, 4, 2, 6]})
df

   sex  score
0    1      5
1    2      4
2    1      3
3    3      4
4    2      2
5    1      6

In [10]:
# df.value_counts()에 sort_index()를 적용하면 빈도 기준으로
# 내림차순 정렬하지 않고 변수의 값 순서로 정렬한다.
df['sex'].value_counts().sort_index()

sex
1    3
2    2
3    1
Name: count, dtype: int64

In [11]:
df['score'].value_counts().sort_index()

score
2    1
3    1
4    2
5    1
6    1
Name: count, dtype: int64

In [12]:
# sex가 3이면 NaN 부여
df['sex'] = np.where(df['sex'] == 3, np.nan, df['sex'])
df

   sex  score
0  1.0      5
1  2.0      4
2  1.0      3
3  NaN      4
4  2.0      2
5  1.0      6

In [13]:
# score가 5보다 크면 NaN 부여
df['score'] = np.where(df['score'] > 5, np.nan, df['score'])
df

   sex  score
0  1.0    5.0
1  2.0    4.0
2  1.0    3.0
3  NaN    4.0
4  2.0    2.0
5  1.0    NaN

In [14]:
# 결측치를 제거한 다음 성별에 따른 score 평균을 구하자.
# 순서 : sex, score 결측치 제거 -> sex별 분리 -> score 평균 구하기
df.dropna(subset=['sex', 'score'])\
.groupby('sex')\
.agg(mean_score = ('score', 'mean'))

     mean_score
sex
1.0         4.0
2.0         3.0